/***************************************************************************************************
Описание: Преобразование из трёхфазной СК в двухфазную и обратно
Разработчик: Литвинов Олег
Заметки:
***************************************************************************************************/
#include "adc.h"
#include "motor_revert.h"
#include "motor_speed.h"
#include <math.h>
 
/***************************************************************************************************
Локальные дефайны
***************************************************************************************************/
#define PI 3.14159265
#define MAX_CURRENT 1000
#define MAX_VOLTAGE 1000
#define ALPHA 0.5

/***************************************************************************************************
Прототипы локальных функций
***************************************************************************************************/
int32_t lowPassFilterCurrentAlpha(int32_t newCurrentAlpha);
int32_t lowPassFilterCurrentBeta(int32_t newCurrentBeta);

int32_t ParksTransAlphaBetaToX(float phi, int32_t projAlpha, int32_t projBeta);
int32_t ParksTransAlphaBetaToY(float phi, int32_t projAlpha, int32_t projBeta);

int32_t InvParksTransXYtoAlpha(float phi, int32_t projX, int32_t projY);
int32_t InvParksTransXYtoBeta(float phi, int32_t projX, int32_t projY);

/***************************************************************************************************
Локальные переменные файла
***************************************************************************************************/
static int32_t voltage_A;
static int32_t voltage_B;
static int32_t voltage_C;

static int32_t currentAlphaToDQ = 0; 
static int32_t currentBetaToDQ = 0;

static int32_t currentAlphaToABC = 0; 
static int32_t currentBetaToABC = 0;

static int32_t currentX;
static int32_t currentY;

/***************************************************************************************************
Глобальные функции
***************************************************************************************************/
/***************************************************************************************************
Описание: Быстрое извлечение обратного квадратного корня 
Аргументы: Обратный квадратный корень из чего хотим вычислить
Возврат:   Обратный квадратный корень числа
Замечания: 
***************************************************************************************************/
float fastInvSqrt(float x)
{
    float xhalf = 0.5f * x;
    uint32_t i = *(uint32_t*)&x;
    i = 0x5F3759DF - (i >> 1);
    x = *(float*)&i;
    x = x*(1.5f - xhalf*x*x);
    return x;
}

/***************************************************************************************************
Описание: Быстрое извлечение квадратного корня 
Аргументы: Квадратный корень из чего хотим вычислить
Возврат:   Квадратный корень числа
Замечания: 
***************************************************************************************************/
float fastSqrt(float x)
{
    if (x <= 0)
        return 0;

    // представление х в виде x = mantissa * 2 ^ exponent
    // мантисса записывается в х, степень числа 2 - в exp
    int exp;
    x = frexp(x, &exp);
    
    if (exp & 1)
    {      // we want exponent to be even
        exp--;
        x *= 2;
    }
    float y = (1+x)/2; // first approximation
    float z = 0;
    while (y != z)
    {    // yes, we CAN compare doubles here!
        z = y;
        y = (y + x/y) / 2;
    }
    return ldexp(y, exp/2); // multiply answer by 2^(exp/2) -> return sqrt
}

/***************************************************************************************************
Описание: Перевод из подвижной СК статора в неподвижную ось Alpha
Аргументы: Проекции тока на оси X и Y, угол повотора статора 
Возврат:   Проекция на неподвижную ось Alpha
Замечания: 
***************************************************************************************************/
int32_t InvParksTransXYtoAlpha(float phi, int32_t projX, int32_t projY)
{
    int32_t projAlpha = (-1) * projY* sinf(2 * PI * phi / 1024) + projX * cosf(2 * PI * phi / 1024);
    
    return projAlpha;
}

/***************************************************************************************************
Описание: Перевод из подвижной СК статора в неподвижную ось Beta
Аргументы: Проекции тока на оси X и Y, угол повотора статора 
Возврат:   Проекция на неподвижную ось Beta
Замечания: 
***************************************************************************************************/
int32_t InvParksTransXYtoBeta(float phi, int32_t projX, int32_t projY)
{
    int32_t projBeta = projX * sinf(2 * PI * phi / 1024) + projY * cosf(2 * PI * phi / 1024);
    
    return projBeta;
}

/***************************************************************************************************
Описание: Чтение с ацп и преобразование в необ скоростной диапазон 
Аргументы: Нет
Возврат:   Нет
Замечания: АЦП выдает от 0 до 4096. -2048 - т.к. смещение на 1.65В - Опорное напряжение АЦП
***************************************************************************************************/
int32_t getCurrentFromADC(uint8_t numberOfValue)
{
    return adc_getValue(numberOfValue) - 2048;
}

/***************************************************************************************************
Описание: Переход из трехфазной в подвижную двуфазную СК статора, перпендикулярную оси ротора
Аргументы: Проекции тока в трехфазной СК статора
Возврат: Нет
Замечания: 
***************************************************************************************************/
void transf_ABC_to_moving_XY(int32_t currentA, int32_t currentB, int32_t currentC, uint16_t currentAngle)
{
    // Переход из трехфазной СК статора в двуфазную альфа-бета
    currentAlphaToDQ = currentA;
    currentBetaToDQ = (currentA + 2 * currentB) * fastInvSqrt(3);

    // ФНЧ альфа-бетта составляющих
    currentAlphaToDQ = lowPassFilterCurrentAlpha(currentAlphaToDQ);
    currentBetaToDQ = lowPassFilterCurrentBeta(currentBetaToDQ);

    // Переход из неподвижной альфа-бета в подвижную dq
    currentX = ParksTransAlphaBetaToX(currentAngle, currentAlphaToDQ, currentBetaToDQ); 
    currentY = ParksTransAlphaBetaToY(currentAngle, currentAlphaToDQ, currentBetaToDQ);
}

/***************************************************************************************************
Описание: Перевод из двуфазной в трехфазную СК статора
Аргументы: Проекции тока на оси alfa, Beta
Возврат:   Нет
Замечания: 
***************************************************************************************************/
void transf_XY_to_static_ABC(int32_t curD, int32_t curQ, uint16_t tempPosition)
{
    // Переход из подвижной СК d'q' в неподвижную альфа, бетта
    currentAlphaToABC = InvParksTransXYtoAlpha(tempPosition, curD, curQ);
    currentBetaToABC = InvParksTransXYtoBeta(tempPosition, curD, curQ);
    
    // Переход из двуфазной в трехфазную СК статора
    voltage_A = currentAlphaToABC;
    voltage_B = fastSqrt(3) / 2.0 * currentBetaToABC - currentAlphaToABC / 2;
    voltage_C = - currentAlphaToABC / 2 - fastSqrt(3) * currentBetaToABC  / 2;
}

/***************************************************************************************************
Описание: Получение d-составляющей тока статора с обратной связи 
Аргументы: Нет
Возврат:   d-составляющая тока статора
Замечания: Нет
***************************************************************************************************/
 int32_t getCurrentX(void)
 {
     return currentX;
 }
 
  /***************************************************************************************************
Описание: Получение q-составляющей тока статора с обратной связи 
Аргументы: Нет
Возврат:   q-составляющая тока статора
Замечания: Нет
***************************************************************************************************/
 int32_t getCurrentY(void)
 {
     return currentY;
 }
 
 /***************************************************************************************************
Описание: Получение A-составляющей управляющего тока статора 
Аргументы: Нет
Возврат:   A-составляющая тока статора
Замечания: Нет
***************************************************************************************************/
 int32_t getVoltageA(void)
 {
     return voltage_A;
 }
 
  /***************************************************************************************************
Описание: Получение B-составляющей управляющего тока статора 
Аргументы: Нет
Возврат:   B-составляющая тока статора
Замечания: Нет
***************************************************************************************************/
 int32_t getVoltageB(void)
 {
     return voltage_B;
 }
 
  /***************************************************************************************************
Описание: Получение C-составляющей управляющего тока статора 
Аргументы: Нет
Возврат:   C-составляющая тока статора
Замечания: Нет
***************************************************************************************************/
 int32_t getVoltageC(void)
 {
     return voltage_C;
 }

/***************************************************************************************************
Описание: Перевод бета-составляющей из двуфазной СК статора во вращающуюся СК d,q статора
Аргументы: phi - угол поворота ротора в диапазоне 0 - 1024, projAlpha - альфа-составляющая тока
Возврат:   Нет
Замечания: 
***************************************************************************************************/
int32_t ParksTransAlphaBetaToX(float angle, int32_t projAlpha, int32_t projBeta)
{
    int32_t projX = projBeta * sinf((2 * PI * angle) / 1024) + projAlpha * cosf((2 * PI * angle) / 1024);
    
    return projX;
}

/***************************************************************************************************
Описание: Перевод альфа-составляющей из двуфазной СК статора во вращающуюся СК d,q статора
Аргументы: phi - угол поворота ротора в диапазоне 0 - 1024, projAlpha - бетта-составляющая тока
Возврат:   Нет
Замечания: 1024 - разрешение датчика угла поворота
***************************************************************************************************/
int32_t ParksTransAlphaBetaToY(float angle, int32_t projAlpha, int32_t projBeta)
{
    int32_t projY = projBeta * cosf((2 * PI * angle) / 1024) - projAlpha * sinf((2 * PI * angle) / 1024);
    
    return projY;
}

 /***************************************************************************************************
Описание: ФНЧ альфа-составляющей тока на подвижную СК статора альфа, бетта
Аргументы: Новое значение альфа-составляющей тока статора
Возврат:   Отфильтрованное значение
Замечания: 
***************************************************************************************************/
int32_t lowPassFilterCurrentAlpha(int32_t newCurrentAlpha)
{
    static int32_t currentAlphaFiltered = 0;

    currentAlphaFiltered = ALPHA * currentAlphaFiltered + (1 - ALPHA) * newCurrentAlpha;
    return currentAlphaFiltered;
}

 /***************************************************************************************************
Описание: ФНЧ бетта-составляющей тока на подвижную СК статора альфа, бетта
Аргументы: Новое значение бетта-составляющей тока статора
Возврат:   Отфильтрованное значение
Замечания: 
***************************************************************************************************/
int32_t lowPassFilterCurrentBeta(int32_t newCurrentBeta)
{
    static int32_t currentBetaFiltered = 0;

    currentBetaFiltered = ALPHA * currentBetaFiltered + (1 - ALPHA) * newCurrentBeta;
    return currentBetaFiltered;
}
